# Ultralytics YOLO11-OBB for Coal Debris Detection
# Designed for deep green background and multi-category debris as one class

# Parameters
nc: 1 # 杂物统一标注为一个类别
scales:
  # [depth, width, max_channels]
  # 这里推荐使用 's' 或 'm' 规模，以平衡井下/皮带机监控实时性与识别精度
  s: [0.50, 0.50, 1024]
  n: [0.50, 0.25, 1024] # summary: 196 layers, 2695747 parameters, 2695731 gradients, 6.9 GFLOPs

# YOLO11-Coal Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

## YOLO11-Coal Head (PAN-FPN structure with CAA)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # 融合 Backbone P4 的 CAA 特征
  - [-1, 2, C2fCAA, [512, False]] # 13: 融合后的特征再次增强
#  - [-1, 2, C3k2, [512, False]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # 融合 Backbone P3
  - [-1, 2, C2fCAA, [256, False]]  # 13
#  - [-1, 2, C3k2, [256, False]] # 16 (P3/8-small) 浅层更多保留原始细节

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # 融合 Head P4
  - [-1, 2, C2fCAA, [512, False]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # 融合 Head P5
  - [-1, 2, C2fCAA, [1024, True]] # 22 (P5/32-large)
#  - [-1, 2, C3k2, [1024, True]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, OBB, [nc, 1]] # OBB 输出：Detect(P3, P4, P5)

#head:
#  # === 自顶向下路径 (Top-down) ===
#  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
#  - [[-1, 4], 1, Concat, [1]]  # 融合 P4 特征
#  # 【位置 1】：替换原有的 C3k2
#  - [-1, 2, C2fCAA, [512, False]]  # 10
#
#  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
#  - [[-1, 2], 1, Concat, [1]]  # 融合 P3 特征
#  # 【位置 2】：替换原有的 C3k2
#  - [-1, 2, C2fCAA, [256, False]]  # 13
#
#  # === 自底向上路径 (Bottom-up) ===
#  - [-1, 1, Conv, [256, 3, 2]] # 下采样
#  - [[-1, 10], 1, Concat, [1]] # 融合之前的特征
#  # 【位置 3】：替换原有的 C3k2
#  - [-1, 2, C2fCAA, [512, False]]  # 16
#
#  - [-1, 1, Conv, [512, 3, 2]] # 下采样
#  - [[-1, 7], 1, Concat, [1]]  # 融合 P5 特征
#  # 【位置 4】：替换原有的 C3k2
#  - [-1, 2, C2fCAA, [1024, False]] # 19
#
#  # === 检测头 ===
#  - [[13, 16, 19], 1, OBB, [nc, 1]] # Detect